## Restaurant Violations in New York City

The city of New York does restaurant inspections and assigns a grade. Inspections data for various years are available on s3 as an SQLite database, which you can import in the next few cells. These were extracted from a set of CSV files and an XLS file.

The raw data can be found [here](https://s3.amazonaws.com/dataincubator-course/coursedata/nyc_inspection_data.zip) and can be useful to look at. The file `RI_Webextract_BigApps_Latest.xls` contains a description of each of the data files and what the columns mean.

In [1]:
#This will load the pre-existing tables
%load_ext sql
%sql postgresql://docker:docker@nycinspection.tditrain.com:5433/NYCinspection

In [13]:
%%sql

-- retrieve table names in the 'public' schema
SELECT table_name FROM information_schema.tables
WHERE table_schema = 'public';

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
4 rows affected.

[('webextract',), ('violations',), ('cuisine',), ('boroughs',)]

In [5]:
%%sql

-- retrieve the table info. from 'webextract'
SELECT column_name, data_type FROM information_schema.columns
WHERE table_name = 'webextract'
ORDER BY ordinal_position;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
15 rows affected.

[('camis', 'integer'),
 ('dba', 'text'),
 ('boro', 'integer'),
 ('building', 'text'),
 ('street', 'text'),
 ('zipcode', 'text'),
 ('phone', 'text'),
 ('cuisinecode', 'integer'),
 ('inspdate', 'timestamp without time zone'),
 ('action', 'text'),
 ('violcode', 'text'),
 ('score', 'integer'),
 ('currentgrade', 'text'),
 ('gradedate', 'timestamp without time zone'),
 ('recorddate', 'timestamp without time zone')]

## Question 1: Remove Null entries

Identify the number of inspections (`CAMIS`, `INSPDATE` pairs) that do not have a score - i.e. where none of the rows with those (`CAMIS`, `INSPDATE`) values has a score. Remove the corresponding rows from the data set for the rest of the questions.

> **Note:**  This database is _read-only_, so you cannot modify the database to "remove" the rows.  I will make a temporary table (or temporary view) that does this "removal" process and use that temporary table for the remainder of the questions.

In [2]:
%%sql

DROP TABLE IF EXISTS web_sum;

CREATE TEMP TABLE web_sum AS 
SELECT CAMIS, INSPDATE,
        COUNT(INSPDATE) AS n_insp,
        SUM(CASE WHEN SCORE IS NULL THEN 1 ELSE 0 END) AS n_null,
        COUNT(SCORE) AS n_non_null
FROM webextract
GROUP BY CAMIS, INSPDATE

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
168747 rows affected.

[]

In [3]:
%%sql

DROP TABLE IF EXISTS web_updated;

CREATE TEMP TABLE web_updated AS
SELECT webextract.camis AS camis,
        webextract.boro AS boro,
        webextract.zipcode AS zipcode,
        webextract.cuisinecode AS cuiscode,
        webextract.inspdate AS inspdate,
        webextract.violcode AS violcode,
        webextract.score AS score
FROM webextract INNER JOIN (SELECT CAMIS, INSPDATE FROM web_sum WHERE n_insp > n_null) AS INSP
                ON webextract.camis = INSP.camis AND 
                    webextract.inspdate = INSP.inspdate
ORDER BY CAMIS, INSPDATE;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
522812 rows affected.

[]

## Question 2: Score by ZIP code

For each of the 87 ZIP codes, select the cities with over 100 restaurants, and use the score from the latest inspection date for each restaurant. Sort the list in ascending order by mean score.

In [4]:
%%sql

-- create a restaurant table grouped by zipcode with over 100 restaurants.
DROP TABLE IF EXISTS RES_ZIP;

CREATE TEMP TABLE RES_ZIP AS
SELECT ZIPCODE, COUNT(DISTINCT CAMIS) AS N_RES
FROM WEB_UPDATED
GROUP BY ZIPCODE
HAVING COUNT(DISTINCT CAMIS) > 100;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
87 rows affected.

[]

In [5]:
%%sql

-- confine the web_updated table based on the zipcodes listed in RES_ZIP.
DROP TABLE IF EXISTS WEB_ZIP;

CREATE TEMP TABLE WEB_ZIP AS
SELECT WEB_UPDATED.camis AS camis,
        WEB_UPDATED.inspdate AS inspdate,
        WEB_UPDATED.score AS score,
        WEB_UPDATED.zipcode AS zipcode       
FROM WEB_UPDATED INNER JOIN RES_ZIP ON WEB_UPDATED.ZIPCODE = RES_ZIP.ZIPCODE
ORDER BY CAMIS, INSPDATE;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
415270 rows affected.

[]

In [6]:
%%sql

-- use the score from the latest inspection date for each restaurant
DROP TABLE IF EXISTS SCORE_ZIP;
                                                
CREATE TEMP TABLE SCORE_ZIP AS
SELECT WEB_ZIP.CAMIS, WEB_ZIP.INSPDATE, AVG(SCORE) AS SCORE, ZIPCODE
FROM WEB_ZIP INNER JOIN (SELECT DISTINCT CAMIS, MAX(DISTINCT INSPDATE) AS LAT_DATE 
                         FROM WEB_ZIP
                         GROUP BY CAMIS) AS M
                         ON WEB_ZIP.CAMIS = M.CAMIS AND WEB_ZIP.INSPDATE = M.LAT_DATE
GROUP BY WEB_ZIP.CAMIS, WEB_ZIP.INSPDATE, ZIPCODE;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
19172 rows affected.

[]

In [7]:
%%sql

-- create a table of mean score of restaurant in each zipcode
SELECT ZIPCODE, AVG(SCORE) AS MEAN_SCORE, COUNT(DISTINCT CAMIS) AS N_RES
FROM SCORE_ZIP
GROUP BY ZIPCODE
ORDER BY MEAN_SCORE
LIMIT 3;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
3 rows affected.

[('10451', Decimal('9.14285714285714285714'), 154),
 ('10001', Decimal('9.14949494949494949495'), 495),
 ('11430', Decimal('9.68965517241379310345'), 145)]

## Question 3: Score by borough

For each of the city's five boroughs. Use the latest score for each restaurant. Sort the list in ascending order by the mean score.

In [6]:
%%sql

-- create web table grouped by borough
DROP TABLE IF EXISTS WEB_BORO;

CREATE TEMP TABLE WEB_BORO AS
SELECT CAMIS, INSPDATE, SCORE, NAME 
FROM WEB_UPDATED JOIN BOROUGHS AS B
                ON WEB_UPDATED.BORO = B.ID;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
522710 rows affected.

[]

In [7]:
%%sql

-- create score table grouped by borough
DROP TABLE IF EXISTS SCORE_BORO;

CREATE TEMP TABLE SCORE_BORO AS
SELECT WEB_BORO.CAMIS, WEB_BORO.INSPDATE, AVG(SCORE) AS SCORE, NAME
FROM WEB_BORO INNER JOIN (SELECT DISTINCT CAMIS, MAX(DISTINCT INSPDATE) AS LAT_DATE 
                         FROM WEB_BORO
                         GROUP BY CAMIS) AS M
                         ON WEB_BORO.CAMIS = M.CAMIS AND WEB_BORO.INSPDATE = M.LAT_DATE
GROUP BY WEB_BORO.CAMIS, WEB_BORO.INSPDATE, NAME;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
24350 rows affected.

[]

In [8]:
%%sql

SELECT NAME, AVG(SCORE) AS MEAN_SCORE, COUNT(DISTINCT CAMIS)
FROM SCORE_BORO
GROUP BY NAME
ORDER BY MEAN_SCORE;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
5 rows affected.

[('THE BRONX', Decimal('10.77685225778167470408'), 2281),
 ('MANHATTAN', Decimal('11.48963704377717116571'), 9891),
 ('BROOKLYN', Decimal('11.59685416310480424004'), 5849),
 ('QUEENS', Decimal('11.82259553258261030090'), 5417),
 ('STATEN ISLAND', Decimal('11.89912280701754385965'), 912)]

## Question 4: Violations by cuisine

I want to look at violations themselves now.  Since most restaurants have many inspections with possibly multiple violations per inspection, or long stretches of inspections with no violations. There are many ways to deal with this normalization issue, but I'll go with a fairly straightforward one: dividing the number of violations by the length of time (in years) the restaurant has been open.  As a proxy for the length, I'll look at the difference between the oldest and newest inspection date, treating anything less than 30 days as 30 days (to account for those that were only inspected once, assuming everything was open for at least a month).

Since there are so many restaurants, I'll group them by cuisine and do a weighted average by computing 

    (total violations for a cuisine) / (total restaurant-years for that cuisine)

In [9]:
%%sql

-- create web table grouped by violations
DROP TABLE IF EXISTS WEB_VIOL;

CREATE TEMP TABLE WEB_VIOL AS
SELECT CAMIS, MAX(INSPDATE) AS END, MIN(INSPDATE) AS START, 
    CASE 
        WHEN EXTRACT(DAY FROM MAX(INSPDATE)-MIN(INSPDATE)) >= 30 THEN EXTRACT(DAY FROM MAX(INSPDATE)-MIN(INSPDATE))::INT
        WHEN EXTRACT(DAY FROM MAX(INSPDATE)-MIN(INSPDATE)) < 30 THEN 30
    END AS interval, 
    CUISCODE, COUNT(VIOLCODE) AS N_VIOL
FROM WEB_UPDATED
GROUP BY CAMIS, CUISCODE
ORDER BY N_VIOL;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
24361 rows affected.

[]

In [33]:
%%sql

SELECT CUISINE.CODEDESC, SUM(N_VIOL) AS TOTAL_VIOL, SUM(N_VIOL)/(SUM(INTERVAL)/365) AS VIOL_RATE
FROM WEB_VIOL LEFT JOIN CUISINE ON WEB_VIOL.CUISCODE = CUISINE.CUISINECODE
GROUP BY WEB_VIOL.CUISCODE, CUISINE.CODEDESC
HAVING SUM(N_VIOL) > 100
ORDER BY VIOL_RATE
LIMIT 3;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
3 rows affected.

[('Hotdogs/Pretzels', Decimal('144'), Decimal('3.7894736842105263')),
 ('Soups & Sandwiches', Decimal('571'), Decimal('5.8865979381443299')),
 ('Hotdogs', Decimal('432'), Decimal('6.0000000000000000'))]

## Question 5: Specific violations by cuisine

Which cuisines tend to have a disproportionate number of what violations? Answering this question isn't easy because one has to think carefully about normalizations.

1. More popular cuisine categories will tend to have more violations just because they represent more restaurants.
2. Similarly, some violations are more common.  For example, knowing that "Equipment not easily movable or sealed to floor" is a common violation for Chinese restaurants is not particularly helpful when it is a common violation for all restaurants.

The measure I'll be using is the conditional probability of a specific type of violation given a specific cuisine type and divide it by the unconditional probability of the violation for the entire population.

In [12]:
%%sql

-- create a temp table where the violation codes prior to Jan. 1, 2014 were removed
DROP TABLE IF EXISTS VALIDATED_VIOL;

CREATE TEMP TABLE VALIDATED_VIOL AS
SELECT CUISCODE, INSPDATE, VIOLCODE
FROM WEB_UPDATED
WHERE EXTRACT(YEAR FROM INSPDATE) >= 2014 AND CUISCODE > 0 AND VIOLCODE IS NOT NULL;

-- Select data from 'VALIDATED_VIOL', grouping it by certain columns and ordering it
SELECT CUISCODE, INSPDATE, VIOLCODE
FROM VALIDATED_VIOL
GROUP BY CUISCODE, INSPDATE, VIOLCODE
ORDER BY CUISCODE
LIMIT 3;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
119997 rows affected.
3 rows affected.

[(1, datetime.datetime(2014, 8, 2, 0, 0), '10B'),
 (1, datetime.datetime(2014, 6, 18, 0, 0), '04A'),
 (1, datetime.datetime(2014, 7, 17, 0, 0), '06A')]

In [13]:
%%sql

SELECT VIOLCODE, COUNT(VIOLCODE) AS total_viol 
FROM VALIDATED_VIOL
GROUP BY VIOLCODE
LIMIT 3;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
3 rows affected.

[('10E', 838), ('16A', 153), ('07A', 22)]

In [14]:
%%sql

DROP TABLE IF EXISTS RATIO;

CREATE TEMP TABLE RATIO AS

SELECT CUISCODE, VIOLCODE, f.count1, f.count2, COUNT1*1.0/COUNT2 AS FREQ1
FROM (
    SELECT 
        CUISCODE, 
        VIOLCODE, 
        COUNT(*) OVER(PARTITION BY CUISCODE, VIOLCODE) AS COUNT1,
        COUNT(*) OVER(PARTITION BY CUISCODE) AS COUNT2
    FROM VALIDATED_VIOL
    ) AS F
GROUP BY CUISCODE, VIOLCODE, f.count1, f.count2
HAVING COUNT1 > 100
ORDER BY FREQ1 DESC;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
Done.
238 rows affected.

[]

In [15]:
%%sql

SELECT CUISCODE, VIOLCODE, FREQ1, COUNT1
FROM RATIO right JOIN CUISINE ON RATIO.CUISCODE = CUISINE.CUISINECODE
LIMIT 3;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
3 rows affected.

[(29, '10F', Decimal('0.24335904027420736932'), 284),
 (39, '10F', Decimal('0.22242760320394331485'), 361),
 (43, '10F', Decimal('0.20550847457627118644'), 194)]

In [30]:
%%sql

SELECT CUISINE.CODEDESC, VIOLATIONS.VIOLATIONDESC, RATIO.FREQ1 AS RATIO, RATIO.COUNT1 AS COUNT
FROM RATIO
LEFT JOIN CUISINE ON RATIO.CUISCODE = CUISINE.CUISINECODE
LEFT JOIN VIOLATIONS ON RATIO.VIOLCODE = VIOLATIONS.VIOLATIONCODE
GROUP BY CUISINE.CODEDESC, VIOLATIONS.VIOLATIONDESC, RATIO.FREQ1, RATIO.COUNT1
ORDER BY RATIO DESC
LIMIT 3;

 * postgresql://docker:***@nycinspection.tditrain.com:5433/NYCinspection
3 rows affected.

[('Donuts', 'Non-food contact surface improperly constructed. Unacceptable material used. Non-food contact surface or equipment improperly maintained and/or not properly sealed, raised, spaced or movable to allow accessibility for cleaning on all sides, above and underneath the unit.', Decimal('0.24335904027420736932'), 284),
 ('Donuts', 'Equipment not easily movable or sealed to floor, adjoining equipment, adjacent walls or ceiling. Aisle or workspace inadequate.', Decimal('0.24335904027420736932'), 284),
 ('Hamburgers', 'Equipment not easily movable or sealed to floor, adjoining equipment, adjacent walls or ceiling. Aisle or workspace inadequate.', Decimal('0.22242760320394331485'), 361)]

*Copyright &copy; 2022 Pragmatic Institute. This content is licensed solely for personal use. Redistribution or publication of this material is strictly prohibited.*